{
  "buttons": {
    "close": "Close",
    "goHome": "Go back to home",
    "ok": "OK, got it",
    "start": "Let's get started"
  },
  "contents": {
    "about": {
      "main": "Hi there, my full name is Seyed Mohammad Ali Kazemi Sheykh Shabani, which is too long but I like it. But for the sake of its longness, I chose a nickname for myself which is SMAKSS or a simpler version that I like the most is Max. I assume my self a software engineer, I assumed it because I know nothing about it. Before I assumed myself a software engineer I used to play video games a lot, so I was kind of gamer . I learnt about PC, games, and other stuff since I was a lil kid (2-3 years old). Then nothing in the world was more desirable than games for me. I did not enjoy school at all, even the university years were more awful. I studied computer science at the university, I didn't have a clue about it and what is it at all, but with all of these disasters, I managed to start programming and since the second year of the undergraduate study (2013) I start working. In those days I just knew how to copy-paste previous codes that I have to create a new thing . It may seem weird in the first place but honestly, it worked almost all the time. Later on, I managed to work with some utility software like Photoshop and Illustrator, and you may not believe that but I just work with them like how I code . With all the applicable skills (Who cares about them ) I manage to work with some startups and even start my own one with a bunch of comrades (I'm not a communist myself but I found Marx and some of the idea behind it reasonable). In all of those years, I struggle a lot and tried to make a better version of myself and finally, I could take an internship in Microsoft as a Software Engineer, it was about three though months of my life, but I learnt a lot in those months more than all the previous years. After that, I applied for some opportunities in that company and could pass the initial test in some of them but since I always loved gaming stuff I rather worked with ATG (Advanced Technology Group) team. I always enjoyed being into new things and experience some new stuff, so I decide to get into web developing area, I worked with WordPress before but I knew nothing about the whole thing. Like before I start educating myself with online courses, I really wanted to get into this area so I tried to apply some application in the Microsoft itself but it turns out I knew nothing about web developing at all, so I couldn't pass the initial test. Those days were too exhausting, after working with Microsoft for about one year I just resigned and quit my job (I was a kiddo and I missed those days a lot ). I was in the middle of nowhere but I decide to start working on something so I just joined some new startup in Iran and tried to learn how to develop a real web application, as I said I knew nothing about it but I start working on a health application as a Full-Stack web developer I call it Full-Stack because I worked with 3 different stacks, one in the Frontend, one in the Backend, and another in Serverside. I worked with those tools for about 8 months, I learnt a lot about web application but I didn't really love what I did there, all of those stuff sometimes made me uncomfortable and overwhelming so I resigned and quit my job once again. But this time I knew what I'm going to do I just wanted to work with a single side of the application either Backend, Frontend or Server. So I applied for some other companies for each of the them separately. I do not know how to call it maybe fate or whatever, but I suddenly found myself within a cool-ish company as a Frontend Engineer, since then I obsessed with Frontend tools and I like to continue my journey in this area. And that is what it is."
    },
    "cookie": "I have to admit it, I'm using cookie to provide a better user experience.",
    "info": {
      "description": "First of all, thanks for paying me a visit. Well, unlike people common opinion, designing and implementing a website is hard, but doing all this on your own and producing a cool result is damn hard. I'm not saying this is very cool (Who cares maybe it is!) but I tried my best on it. I built this all mostly for sharing my insights, also a showcase, and sharing new ideas. The whole source code of it (Its got many bugs right now ), is available on my GitHub page, so if you enjoyed it, you can fork it and create your own exclusive one, then you can buy me a coffee in return (Link is available in the very bottom of each page).",
      "ps": "P.S.: You also may ask what the heck is going on with the quote thing? I have to say it is fun, cool, and maybe insightful. In addition, it is provided by",
      "quotable": "Quotable service.",
      "title": "You may ask what are all these about?"
    }
  },
  "descriptions": {
    "about": "Know more about me.",
    "index": "Hi there, I'm Max a Software Engineer: Frontend, who seeks to move mankind one step forward. I will try to share my personal insights here.",
    "stuff": "Well, this is about, getting to know my stuff."
  },
  "errors": {
    "404": "It's a shame, I can't find the page that you're looking for.",
    "error": "Oops, it seems an error occurred."
  },
  "links": {
    "about": "About Me",
    "donate": "Buy Me a Coffee",
    "english": "English",
    "persian": "Farsi",
    "stuff": "Stuff",
    "blog": "Blog"
  },
  "main": {
    "content": "You can check each pillar to know more about me and my stuff.",
    "header": {
      "partOne": "Get to Know,",
      "partTwo": "My Stuff"
    },
    "pillars": {
      "comingSoon": "Will be available soon!",
      "content": {
        "summary": "My background is in computer science, and I've always tried to create stuff. I am radically passionate about new things, especially in technology. I believe good people within a good and smart team is in a higher place in the order of power than a successful product. I love getting my hands dirty to create a seamless app to bring joy to whoever using it. Usually, I'm overwhelmed at work, but I do like hiking, reading, video games, music, movies, and dogs.",
        "summaryFinalThing": "I enjoy the path that I've taken, and I'm looking forward to the next step, I hope that I can take one small step for mankind."
      },
      "experience": {
        "shopify": {
          "company": "Shopify",
          "description": "As a seasoned front-end developer, I have a rich history of designing, developing, and optimising Shopify applications. I've been at the forefront of creating various applications, from customisable product pages to sophisticated analytics tools. I pride myself on my proficiency with multiple technologies, including jQuery, SCSS, React, Remix, Svelte, NPM Modules, D3.js, and Polaris. One of my proudest achievements was transitioning a legacy jQuery e-commerce platform to a cutting-edge React.js framework, resulting in marked performance and user experience improvements. I've also pioneered efficient architectural approaches for internal modules using Shopify CLI and have taken the initiative to publish standalone NPM modules to enhance compatibility with other Shopify add-ons. Always looking to innovate, I introduced a more efficient UX testing process for marketing platforms by integrating Cypress. Furthermore, I've built robust CI/CD pipelines for front-end applications to ensure smooth and dependable code deployment, leveraging tools like danger.js and PostCSS.",
          "duration": "Mar 2022 - Current",
          "location": "Vancouver, British Colombia, Canada",
          "role": "Frontend Engineer",
          "stack": "JavaScript 路 Cascading Style Sheets (CSS) 路 Computer Science 路 jQuery 路 React.js 路 HTML5 路 SASS 路 Node.js 路 JavaScript Libraries"
        },
        "coin-plus": {
          "company": "CoinPlus",
          "description": "CoinPlus is a financial technology company that offers Blockchain-related solutions to institutional and individual investors. I've worked on two different products, Sarrafeh and TexToken and was responsible for analyzing and implementing new features and managing the front-end team and their work. I've Built two separate apps for each product from the ground up. I also Scaled up the existing features on both the client and admin sides. Upgrade and maintain the old admin panel to be faster.",
          "duration": "Dec 2020 - Jun 2022",
          "links": {
            "coinPlus": {
              "name": "CoinPlus"
            },
            "sarrafeh": {
              "name": "Sarrafeh"
            },
            "texToken": {
              "name": "TexToken"
            }
          },
          "location": "Tehran, Iran",
          "role": "Frontend Engineer",
          "stack": "Software Infrastructure 路 JavaScript 路 Cascading Style Sheets (CSS) 路 React.js 路 HTML5 路 SASS 路 Node.js 路 JavaScript Libraries"
        },
        "sana-gostar-sabz": {
          "company": "Sana Gostar Sabz",
          "description": "Sana was the parent company of three different products like home services, transportation, and big data manipulation. I have worked on two different products called the Ubaar and the Achareh. I could maintain and scale up the codebase and make the old codebase work faster. I also create two different web apps for each product with over 2+m users, exclusive PWA for the Achareh experts, and some brand new landings and many more cool features for both the Ubaar and the Achareh.",
          "duration": "Jan 2019 - Jan 2021",
          "links": {
            "sanaGostarSabz": {
              "name": "Sana Gostar Sabz"
            },
            "achareh": {
              "name": "Achareh"
            },
            "ubaar": {
              "name": "Ubaar"
            }
          },
          "location": "Tehran, Iran",
          "role": "Frontend Engineer",
          "stack": "Apache 路 Software Infrastructure 路 JavaScript 路 Cascading Style Sheets (CSS) 路 jQuery 路 PHP 路 Vue.js 路 React.js 路 HTML5 路 SASS 路 Nuxt.js 路 Redux.js 路 Embedded JavaScript (EJS)"
        },
        "pergas-it-solutions": {
          "company": "Pergas IT Solutions",
          "description": "Pergas IT Solutions is an IT department that works beneath the Pergas Teb (L谩 farrerr) company. Its purposes focused on web applications for the corporation. As a frontend engineer, I focused on managing and leading frontend team members, and also delivering and designing a best-suited platform that works fine for the colleagues and other related users that fulfil their job through the platform.",
          "duration": "Dec 2019 - Apr 2020",
          "location": "Tehran, Iran",
          "role": "Frontend Engineer / Frontend Chapter Lead",
          "stack": "Material-UI 路 JavaScript 路 Cascading Style Sheets (CSS) 路 Team Leadership 路 React.js 路 HTML5 路 SASS"
        },
        "smart-lancer": {
          "company": "SmartLancer",
          "description": "SmartLancer consultancy group has been created to enhance student and entrepreneurs' daily life and it was consist of some different products such as Vianbo and SmartLancer. SmartLancer was a group of consultancy that tries to bring new ideas and make it more convenient for local usage and help the new entrepreneurs and businesses to grow faster. Here at Smartlancer, I tried to make it easier to use and help the local entrepreneurs and startups to get to know the entire business ecosystem more easily. Vianbo is a platform that tries to serve students around the globe by bringing their needs on the line with the help of a social electronic board (SEB). Since I was a student those days, I'm always tried to help others with my proficiency. We've started our first branch of our SEB at the Politecnico di Milano and I'm as a student and also a developer put my skills onto the table to make this platform easier to use and make it efficient.",
          "duration": "Feb 2018 - Jan 2019",
          "location": "Milan, Italy",
          "role": "Software Engineer / Managing Editor",
          "stack": "MySQL 路 Software Infrastructure 路 JavaScript 路 Cascading Style Sheets (CSS) 路 WordPress 路 PHP 路 Team Leadership 路 HTML5"
        },
        "salamatpaad": {
          "company": "Salamatpaad",
          "description": "Salamatpaad was a fitness and diet platform that wanted to bring a healthy body and mind to people (especially women) nationwide. As a full-stack engineer, I've scaled up the old code performance and added new features to the existing platform.",
          "duration": "Jun 2018 - Jan 2019",
          "links": {
            "salamatpaad": {
              "name": "Salamatpaad"
            }
          },
          "location": "Tehran, Iran",
          "role": "Full Stack Engineer",
          "stack": "PhpMyAdmin 路 Apache 路 MySQL 路 JavaScript 路 Cascading Style Sheets (CSS) 路 jQuery 路 PHP 路 Vue.js 路 HTML5"
        },
        "microsoft": {
          "company": "Microsoft",
          "description": "After finding the right people in my life I could finally make the dream come true and start working in Microsoft in the early years of my work career. I worked in Microsoft as an intern software engineer who had to work with some big data and machine learning algorithms, so I start working with azure and instantly after that, I had to develop my knowledge in related languages like Python and C++. After finishing off my internship, I've started working with the Xbox Advanced Technology Group (ATG) as a remote junior software engineer. This team was the bridge that links Microsoft game platforms and services, such as Xbox One, Windows 10, Xbox Live, and Azure with key game developers worldwide. In this role, I have been responsible for developing and enhancing the work of DirectXTK and ATGTK kits and I was able to decrease their load time by 15%.",
          "duration": "Jun 2017 - Jun 2018",
          "links": {
            "XboxATG": {
              "name": "XboxATG"
            }
          },
          "location": "London, United Kingdom",
          "role": "Junior Software Engineer",
          "stack": "Pascal 路 WebGL 路 Unity 路 Microsoft Azure 路 Software Infrastructure 路 Python (Programming Language) 路 C++"
        },
        "persian-acc": {
          "company": "PersianAcc",
          "description": "PersianACC was one of my first full-time severe work, where I and some of my other comrades from the university gathered as a team and simultaneously kept up my work as a full-stack engineer to create a new life experience and bring rough ideas to a working platform. As the only experienced tech guy in the team, I took all the technical responsibility and simultaneously kept up my work as a full-stack engineer. I have created backend services, frontend and native applications for both iOS and Android.",
          "duration": "Jun 2016 - Jun 2017",
          "location": "Tehran, Iran",
          "role": "Full Stack Engineer",
          "stack": "Linux 路 Apache 路 MySQL 路 Xamarin Products 路 Web Technologies 路 Full-Stack Development 路 JavaScript 路 Cascading Style Sheets (CSS) 路 PHP 路 HTML"
        },
        "up-work": {
          "company": "Upwork",
          "description": "Since my second year of university, I have always tried to reach further and beyond; hence, I would rather not be in a single context or field; then, I started to work it out with the small projects and get further to the big ones. In these years of experience, I did several projects with internal and global startups and institutes.",
          "duration": "May 2013 - Jun 2017",
          "location": "Worldwide",
          "role": "Full Stack Engineer",
          "stack": "Frontend 路 Backend 路 Material-UI 路 Babel.js 路 Webpack 路 Xamarin Products 路 MATLAB 路 LaTeX 路 Web Development 路 Web Technologies 路 Software Infrastructure 路 Full-Stack Development 路 JavaScript 路 C++ 路 Vue.js 路 React.js 路 Bootstrap 路 Node.js"
        }
      },
      "headings": {
        "about": "About Me",
        "contribution": "Public Contribution",
        "interactive": "Interactive Resume",
        "npm": "NPM Packages",
        "blog": "Blog",
        "hackernoon": "Hackernoon"
      },
      "labels": {
        "techStack": "Technical stack",
        "usefulLinks": "Useful links"
      },
      "sub-headings": {
        "summary": "Summary",
        "work-experience": "Work Experience"
      }
    }
  },
  "quote": {
    "error": "I'm truly ashamed! We got no quote for you today.",
    "reason": "It may because the quote server is down at the moment.",
    "title": {
      "author": "Search for author",
      "content": "Quote of the day"
    }
  },
  "titles": {
    "about": "About me",
    "contribution": "Public Contribution",
    "cookieConsent": "Cookie consent",
    "dark": "Dark",
    "github": "GitHub",
    "home": "Go to home",
    "index": "SMAKSS",
    "info": "More information",
    "interactive": "Interactive Resume",
    "light": "Light",
    "linkedin": "LinkedIn",
    "npm": "NPMJS",
    "stackoverflow": "Stack Overflow",
    "stuff": "Stuff",
    "switcher": "Switcher",
    "system": "Based on system preferences"
  }
}
