{
  "buttons": {
    "close": "بستـن",
    "goHome": "برگـردیم به صفحـه اصـلی",
    "ok": "باشـه، فهمیـدم",
    "start": "بـزن بـریم"
  },
  "contents": {
    "cookie": "مـن مـجبور شـدم بـرای ارائـه تـجربه کـاربری بهتـر از کوکـی اسـتفاده کـنم.",
    "info": {
      "description": "خـب، اول از هـمه باید بگـم که برخـلاف نظر مشـترک خـیلی از مـردم طـراحی و پیـاده‌سازی یـه وبسایـت کار سخـتیه، اما انجـام دادن همه‌ اینـا بـا یـه خـروجی باحـال خیلـی سخت تـره. نمیخـوام بگـم که این وبسایت باحـاله ولی خـب من همه تلاشـمو براش کـردم. من اینجـارو بیشتـر بخاطر این طـراحی کردم که افـکار و دانستـه‌‌ها‌م‌ ‌رو با بقیه به اشتـراک بـذارم. تمـام سـورس کـد ایـن پـروژه روی گیـت‌هـاب هسـت و قابـل دانـلود و شخـصی سـازیه، پـس اگـه باهـاش حـال کـردین و توانـاییش‌‌رو داشتـید میتـونید منـو یه قـهوه مهمـون کنیـد (اگـه دوسـت داشتیـد کـمک مـالی هـم بکنیـد لینکـش تـه تـه همـه صفحـه‌ها هسـت).",
      "ps": "پ.ن.: ممکنـه بـازم بپرسـید کـه نقـل قـول ایـن وسـط چـی میگـه؟ تـو جوابـش بایـد بگـم که صرفـا باحالـه و ممکنـه الهـام بخـش باشـه (نـقل قـول‌ها ترجـمه نـشدن کـه مفـاهیمـشون تغییـر نکنـه). بعـلاوه برای دستـرسی به ایـن امکـان میتونیـد مراجـعه کنیـد بـه",
      "quotable": "سـرویس نقـل قـول.",
      "title": "مـمکنه بپرسید، ایـنجا کـلن واسه چیه؟"
    }
  },
  "descriptions": {
    "about": "بیشـتر راجـع به مـن بدونـید.",
    "index": "سلام من مکس هستم و مهندس نرم‌افزارم. به دنبال این هستم که اگه بشه، بشریت رو یه گام به جلوتر ببرم. در اینجا سعی دارم دانسته‌هام رو به اشتراک بذارم.",
    "stuff": "در واقع اینجا قراره توانایی‌ و کار‌هامو ببینید."
  },
  "errors": {
    "404": "باعـث شرمنـدگیه، من نتـونستم صفحـه‌ای کـه دنبالشـی رو پیـدا کنم.",
    "error": "اووه، به نظـر مشـکلی پیـش اومـده."
  },
  "links": {
    "about": "دربـاره مـن",
    "donate": "کمـک مـالی",
    "english": "انگلـیسی",
    "persian": "فارسـی",
    "stuff": "کـارهـا",
    "blog": "بـلاگ"
  },
  "main": {
    "content": "د‌رواقـع‌، اینجـا با انتخـاب هر بخـش می تـونید، من، توانایی‌‌هام و کـارهام رو بیشتـر بشناسـید.",
    "header": {
      "partOne": "من و کارهام رو،",
      "partTwo": "بیشـتر بشناسیـد"
    },
    "pillars": {
      "comingSoon": "به زودی در دسترس قرار خواهد گرفت!",
      "content": {
        "summary": "مـن توی دانـشگاه‌ ،علوم کامپیـوتر خوندم و همیشـه سعیم بر خلـق کردن بوده. من به صـورت دیوانه‌واری به چیـزهای جدید علاقه دارم مخصوصـا اگر مربوط به تکنولوژی باشند. باور دارم آدم‌هـای خوب در تیـم های درست حسابـی ،همیشه اولویت بالاتـری نسبت به نتیجه نهایی‌دارند. همیـشه سعی دارم تا اپلیکیشن های بی نظیـری خلـق کنم تا کاربـران ازشون لذت ببرن. معمـولا غرق در کار هستـم اما به سفر، کتاب خـواندن، بازی‌های ویدیـویی، موزیک و فیلم علاقـه دارم.",
        "summaryFinalThing": "از مسیـری که تا اینجا اومدم راضـی ام و امیدوارم بتـونم قدم موثـری برای پیشـرفت همگـان بردارم."
      },
      "experience": {
        "coin-plus": {
          "company": "کویـن پـلاس",
          "description": "کـویـن پلـاس ،شرکتـی فعـال در حوزه تکنـولوژی‌‌های مالـی علی الخـصوص بلاکچِـین است و راهـکارهای خـود در این زمیـنه را در دسترس مراکز تخصصی و افراد میگذارد. مـن‌ در این شرکـت بر روی دو محصول مختـلف به نـام‌هـای صرافـه و تکـس توکـن کار کردم و مسئـول ارزیـابی، پیـاد‌ه‌‌سـازی و مدیریت تیم فرانت‌انـد بودم. من برای هر دوی این محصولات اپلیکیشن مستقلی رو از پایه، پیاده سـازی کردم که هم اکنون با بیـش از ۲۰هزار کاربر مشفول فعالیـت هستند. همچـنین در این مدت تونستـم تا اپلیکشین موجود در سمـت ادمین رو بهـبود بدم.",
          "duration": "دی ۱۳۹۹ - تاکـنون",
          "links": {
            "coinPlus": {
              "name": "کویـن‌پـلاس"
            },
            "sarrafeh": {
              "name": "صـرافـه"
            },
            "texToken": {
              "name": "تکـس توکـن"
            }
          },
          "location": "تـهران، ایـران",
          "role": "Frontend Engineer",
          "stack": "HTML / CSS / SCSS / JavaScript / ReactJS / Redux"
        },
        "sana-gostar-sabz": {
          "company": "سـانا گسـتر سبـز",
          "description": "سـانا شرکت مادر سه محصـول مختلف ماننـد خدمات خانـگی، حمل و نقـل و دستکـاری کلان داده‌ها بود. من روی دو محصـول مختلف به نـام‌های اوبـار و آچـاره کار کرده‌ام. من تونستـم با نگهـداری و بهینه‌سـازی کدهای موجود سرعت اجـرا اون‌هـارو بالا ببـرم. همچـنین تونستـم دوتا اپلیکیشـن مختـص هر کدوم از محصـولات رو پیاده‌سـازی کنم که هم اکنـون دارای بیش از ۲ میلیـون کاربر هسـت. در آخر هم پیاده‌سـازی یه اپلیکیشن برای متخصصـان آچـاره و همچنین چندین صفحه لندینـگ باحال،  از جمله کارهـایی بوده که انجـام دادم.",
          "duration": "دی ۱۳۹۷ - دی ۱۳۹۹",
          "links": {
            "sanaGostarSabz": {
              "name": "سـانا گسـتر سبـز"
            },
            "achareh": {
              "name": "آچـاره"
            },
            "ubaar": {
              "name": "اوبـار"
            }
          },
          "location": "تـهران، ایـران",
          "role": "Frontend Engineer",
          "stack": "HTML / CSS / SCSS / JavaScript / jQuery / VueJS / VueX / ReactJS / Redux / PM2 / Apache / NginX"
        },
        "pergas-it-solutions": {
          "company": "پِرگـاس",
          "description": "پـرگاس یک بخش فناوری اطـلاعات است که زیر نظر شرکت پرگـاس طـب کار می کند. هدف ایجاد این بخش، ساخت برنامه‌های کاربـردی درون سازمانی بود. مسئولیت من در این مجموعـه مدیریـت و رهبری اعضای تیم فرانت‌اند بود و همچنین تمرکز خودم روبر ارائه و طراحی بهترین پلتفرم که برای همکـاران و سایر کاربران مرتبـط که کار خود را از طریق پلتفـرم انجام می‌دهنـد، گذاشتم.",
          "duration": "دی ۱۳۹۸ - فروردیـن ۱۳۹۹",
          "location": "تـهران، ایـران",
          "role": "Frontend Engineer / Frontend Chapter Lead / Product Owner",
          "stack": "HTML / CSS / SCSS / MaterialUI / JavaScript / ReactJS"
        },
        "smart-lancer": {
          "company": "اسمـارت لنسـر",
          "description": "گروه مشاوره اسمـارت لنسـر برای ارتقای زندگی روزمره دانشجویان و کارآفرینان ایجاد شده بود و از محصولات مختلفی مانند ویانبـو و اسمـارت لنسـر تشکیل شده است. اسمـارت لنسـر گروهی از مشاوران بودند که سعی می‌کردند ایده‌های جدیـد را جمع آوری کنن و اون رو برای استفـاده محلی راحت‌تر کنند و به کارآفرینان و مشاغـل جدید کمک کند تا سریع‌تـر رشد کنند. در اسمـارت لنسـر، سعی کردم استفاده از  این پروداکت رو آسان‌تر کنم و به کارآفرینـان محلی و استارت‌آپ‌هـا برای شناخت بهتر کل اکـوسیستم کسب‌وکار کمک کنم. همینطور ویانبـو پلتفرمی بود که سعی می کرد با کمک یک برد الکترونیکی اجتماعی (SEB) به دانشجویـان در سراسر جهان کمک کنند تا نیازهای خودشون رو از طریق یک پلتفرم محلی برطرف کنند. از آنجایی که آن روزها دانشجو بودم، همیشه سعی کردم با مهارت خود به دیگران کمک کنـم. ما اولین شعبه SEB خود را در Politecnico di Milano راه‌اندازی کرده‌ایم و من به عنوان یک دانشجـو و همچنیـن یک توسعه‌دهنده، مهارت‌هایم را روی میز قرار دادم تا استفـاده از این پلتفرم را آسان‌تر و کارآمدتر کنم.",
          "duration": "آبـان ۱۳۹۶ - دی ۱۳۹۷",
          "location": "میـلان، ایتالـیا",
          "role": "Software Engineer / Iran Affair Director / Managing Editor",
          "stack": "HTML / CSS / JavaScript / C# / Xamarin / Linux / Apache / MySQL / PHP"
        },
        "salamatpaad": {
          "company": "سلامتپـاد",
          "description": "سلامتپـاد یک پلتفرم تناسب اندام و رژیم غذایی بود که سعی داشت بدن و ذهنی سالـم را برای مردم (به ویژه بانوان) در سراسر کشور به ارمغان بیـاورد. من مسئول افزایش عملکرد کدهای قدیمی و افزودن برخی ویژگی‌های جـدید به پلتفرم موجود بودم. در این نقـش، توانستـم بدهی فنی پروژه را از ۳۶۲ روز به تقریباً ۴۰ روز کاهش دهـم و برخی ویژگی‌های جدید مانند طرح‌بندی جدید وب، پخش ویدیو، پخش پادکست، تولید محتـوا و بسیاری موارد جالب دیـگر را به محصول موجـود اضافه کنم.",
          "duration": "خـرداد ۱۳۹۷ - دی ۱۳۹۷",
          "links": {
            "salamatpaad": {
              "name": "سلامتپـاد"
            }
          },
          "location": "تـهران، ایـران",
          "role": "Full Stack Engineer",
          "stack": "HTML / CSS / JavaScript / jQuery / VueJS / Apache / MySQL / PHP"
        },
        "microsoft": {
          "company": "مایکـروسافـت",
          "description": "پس از یافتن افراد مناسـب در زندگـی‌ام، سرانجام توانستم این رویا را محقـق کنـم و در سال‌های اولیه کارم در مایکروسافت شروع به کار کنم. من در مایـکروسافـت به عنوان یک مهندس نرم‌افزار کارآموز کار خودم رو شروع کردم که باید با برخی از داده‌های بزرگ و الگوریتـم‌های یادگیـری ماشین کار می‌کـرد، بنابراین کار با آژور را شروع کردم و بلافاصله پس از آن، تلاش کردم دانش خود را در زبان‌های مرتبط ماننـد Python و C++ توسعه دهم. پس از پایان دوره کارآموزی، کار با گروه فناوری پیشرفته Xbox (ATG) را به عنوان یک مهندس نرم افزار جوان از راه دور شروع کـردم. این تیم پلی بود که پلتفرم‌ها و سرویس‌هـای بازی مایکروسافـت مانند Xbox One، Windows 10، Xbox Live و Azure را با توسعه‌دهنـدگان کلیدی بازی در سراسر جهان پیوند می‌داد. در این نقش، من مسئولیـت توسعه و ارتقای کار کیت‌های DirectXTK و ATGTK را بر عهده داشتم و توانستم زمان بارگذاری آنها را ۱۵٪ کاهش دهم.",
          "duration": "دی ۱۳۹۶ - دی ۱۳۹۷",
          "links": {
            "salamatpaad": {
              "name": "ATG ایکسـباکس"
            }
          },
          "location": "لنـدن، انگلسـتان",
          "role": "Junior Software Engineer",
          "stack": "Python / Azure / C++ / Pascal"
        },
        "persian-acc": {
          "company": "پرشیـن‌اک",
          "description": "پرشیـن‌اک یکی از اولین کارهای تمام وقت جـدی من بود، جایی که من و برخی از رفقای دیگرم از دانشگاه به عنوان یک تیم گرد هم آمدیم تا یک تجربه زندگی جدید ایجاد کنیم و ایده های خام  را به یک پلتفرم کاری دربیاوریم. من به عنوان تنها مرد فناوری با تجربه در تیم تمام مسئولیـت های فنی را بر عهده داشتم و به عنوان یک CTO و مهندس فول استک به کار خود ادامه داد. من مسئول ایجاد سرویس های باطن، فرانت اند و برنامه‌های بومی برای iOS و اندروید بوده ام. در این موقعیت توانستم تعدادی از همکارانـم را آموزش دهم و اصول کدنویسـی را به آنها آموزش دهم. ما همچنین می توانیم سه محصول مختلف تولید کنیم و آنها را به مشتریان خود بفـروشیم.",
          "duration": "خـرداد ۱۳۹۵ - مهـر ۱۳۹۶",
          "location": "تـهران، ایـران",
          "role": "Full Stack Engineer",
          "stack": "HTML / CSS / JavaScript / C# / Xamarin / Linux / Apache / MySQL / PHP / Python"
        },
        "up-work": {
          "company": "آپـورک",
          "description": "از سال دوم دانشگاه، همیشه سعی کردم به فراتر از آن برسـم، از این رو ترجیح می‌دهـم در یک زمینه یا زمینه واحد نباشم، سپس با پروژه‌های کوچـک شروع به کار کردم و به سمت پروژه‌های بزرگ پیش رفتم. در این سالها تجربه چنـدین پروژه با استارتاپ ها و موسسـات داخلی و جهانـی انجـام دادم.",
          "duration": "خـرداد ۱۳۹۳ - تاکـنون",
          "location": "جهـانی",
          "role": "Software Engineer",
          "stack": "C++ / C#.net / Prolog / Matlab / Python / Latex / Shell Scripts / Apache / Nginx / PM2 / Git / SQL / NoSQL / MySQL / MongoDB / Postgresql / Redis / Azure / Hadoop / PHP / JavaScript / CSS3 / SCSS / SASS / HTML5 / Laravel / Codeigniter / JQuery / Nuxt.js / Vue.js (Vue) / Vuex / Next.js / React.js (React) / Redux / Node.js / NPM / Yarn / GraphQL / Ajax / Axios / Grunt / Webpack / Babel / XML / JSON / Swagger / Xamarin / MVC / SEO / SPA (Single Page Application) / PWA (Progressive Web Application) / RESTful and WebSocket APIs / Functional Programming / OOP (Object Oriented Programming) / Asynchronous Programming"
        }
      },
      "headings": {
        "about": "دربـاره مـن",
        "contribution": "هـمکـاری عـمومـی",
        "interactive": "رزومـه تـعاملـی",
        "npm": "پکـیج‌های اِن‌پـی‌اِم",
        "blog": "بـلاگ"
      },
      "labels": {
        "techStack": "ابـزارهـا",
        "usefulLinks": "لینکـهای مـفیـد"
      },
      "sub-headings": {
        "summary": "خـلاصـه کوتـاه",
        "work-experience": "تجـربـه کـاری"
      }
    }
  },
  "quote": {
    "error": "مـن واقـعا متاسفم! بـرای امـروز نـقل قـول نداریـم.",
    "reason": "مـمکنه دلـیلش بـخاطر در دستـرس نـبودن سـرویس نـقل قـول‌هـا بـاشه.",
    "title": {
      "author": "جستجـو نویسـنده",
      "content": "نـقل قـول امـروز"
    }
  },
  "titles": {
    "about": "دربـاره مـن",
    "contribution": "هـمکـاری عـمومـی",
    "cookieConsent": "قبـول کـوکی",
    "dark": "تـیره",
    "github": "گیت‌هاب",
    "home": "بازگشت به صفحه اصلی",
    "index": "SMAKSS",
    "info": "اطـلاعات بیشـتر",
    "interactive": "رزومـه تـعاملـی",
    "light": "روشـن",
    "linkedin": "لینکداین",
    "npm": "اِن‌پی‌اِم‌جِی‌اِس",
    "stackoverflow": "استک اورفلو",
    "stuff": "کارها",
    "switcher": "تعویض کننده",
    "system": "بـر اسـاس تنظیمات سیستم"
  }
}
