{
  "titles": {
    "index": "SMAKSS",
    "home": "Go to home",
    "switcher": "Switcher",
    "dark": "Dark",
    "light": "Light",
    "system": "Based on system preferences",
    "stackoverflow": "Stack Overflow",
    "linkedin": "LinkedIn",
    "github": "GitHub",
    "npm": "npmjs",
    "info": "More information",
    "cookieConsent": "Cookie consent"
  },
  "descriptions": {
    "index": "Hi there, I'm MAKSS a Software Engineer: Frontend, who seeks to move mankind one step forward. I will try to share my personal insights here."
  },
  "errors": {
    "404": "It's a shame, I can't find the page that you're looking for.",
    "error": "Oops, it seems an error occurred. I do not truly deserve your kindness."
  },
  "links": {
    "english": "English",
    "persian": "Farsi",
    "donate": "Buy me a coffee",
    "about": "About Me"
  },
  "buttons": {
    "close": "Close",
    "ok": "OK, got it",
    "goHome": "Go back to home",
    "start": "Let's get started"
  },
  "quote": {
    "error": "I'm truly ashamed! We got no quote for you today.",
    "reason": "It may because the quote server is down at the moment.",
    "title": {
      "content": "Quote of the day",
      "author": "Search for author"
    }
  },
  "contents": {
    "info": {
      "title": "You may ask what are all these about?",
      "description": "First of all, thanks for paying me a visit. Well, unlike people common opinion, designing and implementing a website is hard, but doing all this on your own and producing a cool result is damn hard. I'm not saying this is very cool (Who cares maybe it is!) but I tried my best on it. I built this all mostly for sharing my insights, also a showcase, and sharing new ideas. The whole source code of it, is available on my GitHub page, so if you enjoyed it, you can fork it and create your own exclusive one, then you can buy me a coffee in return (Link is available in the very bottom of each page).",
      "ps": "P.S.: You also may ask what the heck is going on with the quote thing? I have to say it is fun, cool, and maybe insightful. In addition, it is provided by",
      "quotable": "Quotable service."
    },
    "cookie": "I have to admit it, I'm using cookie to provide a better user experience."
  }
}