{
  "buttons": {
    "close": "Close",
    "goHome": "Go back to home",
    "ok": "OK, got it",
    "start": "Let's get started"
  },
  "contents": {
    "about": {
      "main": "Hi there, my full name is Seyed Mohammad Ali Kazemi Sheykh Shabani, which is too long but I like it. But for the sake of its longness, I chose a nickname for myself which is SMAKSS or a simpler version that I like the most is MAKSS. I assume my self a software engineer, I assumed it because I know nothing about it. Before I assumed myself a software engineer I used to play video games a lot, so I was kind of gamer 🎮. I learnt about PC, games, and other stuff since I was a lil kid (2-3 years old). Then nothing in the world was more desirable than games for me. I did not enjoy school at all, even the university years were more awful. I studied computer science at the university, I didn't have a clue about it and what is it at all, but with all of these disasters, I managed to start programming and since the second year of the undergraduate study (2013) I start working. In those days I just knew how to copy-paste previous codes that I have to create a new thing 😁😁. It may seem weird in the first place but honestly, it worked almost all the time. Later on, I managed to work with some utility software like Photoshop and Illustrator, and you may not believe that but I just work with them like how I code 😂. With all the applicable skills (Who cares about them 😎) I manage to work with some startups and even start my own one with a bunch of comrades (I'm not a communist myself but I found Marx and some of the idea behind it reasonable). In all of those years, I struggle a lot and tried to make a better version of myself and finally, I could take an internship in Microsoft as a Software Engineer, it was about three though months of my life, but I learnt a lot in those months more than all the previous years. After that, I applied for some opportunities in that company and could pass the initial test in some of them but since I always loved gaming stuff I rather worked with ATG (Advanced Technology Group) team. I always enjoyed being into new things and experience some new stuff, so I decide to get into web developing area, I worked with WordPress before but I knew nothing about the whole thing. Like before I start educating myself with online courses, I really wanted to get into this area so I tried to apply some application in the Microsoft itself but it turns out I knew nothing about web developing at all, so I couldn't pass the initial test. Those days were too exhausting, after working with Microsoft for about one year I just resigned and quit my job (I was a kiddo and I missed those days a lot 😌). I was in the middle of nowhere but I decide to start working on something so I just joined some new startup in Iran and tried to learn how to develop a real web application, as I said I knew nothing about it but I start working on a health application as a Full-Stack web developer I call it Full-Stack because I worked with 3 different stacks, one in the Frontend, one in the Backend, and another in Serverside. I worked with those tools for about 8 months, I learnt a lot about web application but I didn't really love what I did there, all of those stuff sometimes made me uncomfortable and overwhelming so I resigned and quit my job once again. But this time I knew what I'm going to do I just wanted to work with a single side of the application either Backend, Frontend or Server. So I applied for some other companies for each of the them separately. I do not know how to call it maybe fate or whatever, but I suddenly found myself within a cool-ish company as a Frontend Engineer, since then I obsessed with Frontend tools and I like to continue my journey in this area. And that is what it is."
    },
    "cookie": "I have to admit it, I'm using cookie to provide a better user experience.",
    "info": {
      "description": "First of all, thanks for paying me a visit. Well, unlike people common opinion, designing and implementing a website is hard, but doing all this on your own and producing a cool result is damn hard. I'm not saying this is very cool (Who cares maybe it is!) but I tried my best on it. I built this all mostly for sharing my insights, also a showcase, and sharing new ideas. The whole source code of it (Its got many bugs right now 😁), is available on my GitHub page, so if you enjoyed it, you can fork it and create your own exclusive one, then you can buy me a coffee in return (Link is available in the very bottom of each page).",
      "ps": "P.S.: You also may ask what the heck is going on with the quote thing? I have to say it is fun, cool, and maybe insightful. In addition, it is provided by",
      "quotable": "Quotable service.",
      "title": "You may ask what are all these about?"
    }
  },
  "descriptions": {
    "index": "Hi there, I'm MAKSS a Software Engineer: Frontend, who seeks to move mankind one step forward. I will try to share my personal insights here.",
    "stuff": "Well, this is about, getting to know my stuff."
  },
  "errors": {
    "404": "It's a shame, I can't find the page that you're looking for.",
    "error": "Oops, it seems an error occurred."
  },
  "links": {
    "about": "About Me",
    "donate": "Buy Me a Coffee",
    "english": "English",
    "persian": "Farsi",
    "stuff": "Stuff"
  },
  "main": {
    "content": "Well, you can check each pillar to know more about me and my stuff.",
    "header": {
      "partOne": "Get to Know,",
      "partTwo": "My Stuff"
    },
    "pillars": {
      "comingSoon": "Will be available soon!",
      "content": {
        "summary": "My background is in computer science, and I've always tried to create stuff. I am radically passionate about new things, especially in technology. I believe good people within a good and smart team is in a higher place in the order of power than a successful product. I love getting my hands dirty to create a seamless app to bring joy to whoever using it. Usually, I'm overwhelmed at work, but I do like hiking, reading, video games, music, movies, and dogs.",
        "summaryFinalThing": "I enjoy the path that I've taken, and I'm looking forward to the next step, I hope that I can take one small step for mankind."
      },
      "experience": {
        "coin-plus": {
          "company": "CoinPlus",
          "role": "Frontend Engineer",
          "duration": "Dec 2020 - Present",
          "location": "Tehran, Iran",
          "description": "CoinPlus is a financial technology company with the main focus on offering Blockchain-related solutions to institutional and individual investors. I've worked on two different products called Sarrafeh and TexToken and was responsible for analyzing and implementing new features also managing the front-end team and their work. I've Built two separate apps for each of the products from the ground up and made it work with over 20+k users. I also Scaled up the existing features on both the client and admin sides. Upgrade and maintain the old admin panel to be faster by 40+%."
        }
      },
      "headings": {
        "about": "About Me",
        "contribution": "Public Contribution",
        "interactive": "Interactive Resume",
        "npm": "NPM Packages"
      },
      "sub-headings": {
        "summary": "Summary",
        "work-experience": "Work Experience"
      }
    }
  },
  "quote": {
    "error": "I'm truly ashamed! We got no quote for you today.",
    "reason": "It may because the quote server is down at the moment.",
    "title": {
      "author": "Search for author",
      "content": "Quote of the day"
    }
  },
  "titles": {
    "about": "About me",
    "contribution": "Public Contribution",
    "cookieConsent": "Cookie consent",
    "dark": "Dark",
    "github": "GitHub",
    "home": "Go to home",
    "index": "SMAKSS",
    "info": "More information",
    "interactive": "Interactive Resume",
    "light": "Light",
    "linkedin": "LinkedIn",
    "npm": "npmjs",
    "stackoverflow": "Stack Overflow",
    "stuff": "stuff",
    "switcher": "Switcher",
    "system": "Based on system preferences"
  }
}
