{
  "buttons": {
    "close": "بستـن",
    "goHome": "برگـردیم به صفحـه اصـلی",
    "ok": "باشـه، فهمیـدم",
    "start": "بـزن بـریم"
  },
  "contents": {
    "cookie": "مـن مـجبور شـدم بـرای ارائـه تـجربه کـاربری بهتـر از کوکـی اسـتفاده کـنم.",
    "info": {
      "description": "خـب، اول از هـمه باید بگـم که برخـلاف نظر مشـترک خـیلی از مـردم طـراحی و پیـاده‌سازی یـه وبسایـت کار سخـتیه، اما انجـام دادن همه‌ اینـا بـا یـه خـروجی باحـال خیلـی سختتـره. نمیخـوام بگـم که این وبسایت باحـاله ولی خـب همه تلاشـمو براش کـردم. من اینجـارو بیشتـر بخاطر این طـراحی کردم که افـکار و دانستـه‌هامو به اشتـراک بـذارم. تمـام سـورس کـد ایـن پـروژه روی گیـت‌هـاب هسـت و قابـل دانـلود و شخـصی سـازیه، پـس اگـه باهـاش حـال کـردین و توانـاییشو داشتـید میتـونید منـو یه قـهوه مهمـون کنیـد (اگـه دوسـت داشتیـد کـمک مـالی هـم بکنیـد لینکـش تـه تـه همـه صفحـه‌ها هسـت).",
      "ps": "پ.ن.: ممکنـه بـازم بپرسـید کـه نقـل قـول ایـن وسـط چـی میگـه؟ تـو جوابـش بایـد بگـم که صرفـا باحالـه و ممکنـه الهـام بخـش باشـه (نـقل قـول‌ها ترجـمه نـشدن کـه مفـاهیمـشون تغییـر نکنـه). بعـلاوه برای دستـرسی به ایـن امکـان میتونیـد مراجـعه کنیـد بـه",
      "quotable": "سـرویس نقـل قـول.",
      "title": "مـمکنه بپرسید، ایـنجا کـلن واسه چیه؟"
    }
  },
  "descriptions": {
    "about": "بیشـتر راجـع به مـن بدونـید.",
    "index": "سلام من مکس هستم و مهندس نرم‌افزارم. به دنبال این هستم که اگه بشه، بشریت رو یه گام به جلوتر ببرم. در اینجا سعی دارم دانسته‌هام رو به اشتراک بذارم.",
    "stuff": "در واقع اینجا قراره توانایی‌ و کار‌هامو ببینید."
  },
  "errors": {
    "404": "باعـث شرمنـدگیه، من نتـونستم صفحـه‌ای کـه دنبالشـی رو پیـدا کنم.",
    "error": "اووه، به نظـر مشـکلی پیـش اومـده."
  },
  "links": {
    "about": "دربـاره مـن",
    "donate": "کمـک مـالی",
    "english": "انگلـیسی",
    "persian": "فارسـی",
    "stuff": "کـارهـا"
  },
  "main": {
    "content": "درواقـع، اینجـا با انتخـاب هر بخـش میتـونید، من، توانایی‌هام و کـارهام رو بیشتـر بشناسـید.",
    "header": {
      "partOne": "من و کارهام رو،",
      "partTwo": "بیشـتر بشناسیـد"
    },
    "pillars": {
      "comingSoon": "به زودی در دسترس قرار خواهد گرفت!",
      "content": {
        "summary": "مـن توی دانـشگاه علوم کامپیـوتر خوندم و همیشـه سعیم بر خلـق کردن بوده. من به صـورت دیوانه‌واری به چیـزهای جدید علاقه دارم مخصوصـا اگر مربوط به تکنولوژی باشند. باور دارم آدم‌هـای خوب در تیـمهای درست حسابـی همیشه اولویت بالاتـری نسبت به محصول‌هـای موفق دارن. همیـشه سعی دارم تا اَپـهای بینظیـری خلـق کنم تا کاربـرا ازشون لذت ببرن. معمـولا غرق در کار هستـم اما به سفر، کتاب خـواندن، بازی‌های ویدیـویی، موزیک و فیلم علاقـه دارم.",
        "summaryFinalThing": "از مسیـری که تا اینجا اومدم راضـی هستم و امیدوارم بتـونم قدم موثـری برای پیشـرفت همگـان بردارم."
      },
      "experience": {
        "coin-plus": {
          "company": "کویـن پـلاس",
          "description": "کـویـن پلـاس شرکتـی فعـال در حوزه تکنـولوژی‌های مالـی علی الخـصوص بلاکچِـین است و راهـکارهای خـود در این زمیـنه را در دسترس مراکز تخصصی و افراد میگذارد. مـن در در این شرکـت بر روی دو محصول مختـلف به نـام‌هـای صرافـه و تکـس توکـن کار کردم و مسئـول ارزیـابی، پیـاده‌سـازی و مدیریت تیم فرانت‌انـد بودم. من برای هر دوی این محصولات اپلیکیشنـی مستقل از پایه پیاده سـازی کردم که هم اکنون با بیـش از ۲۰هزار کاربر مشفول فعالیـت هستند. همچـنین در این مدت تونستـم تا اپلیکشین موجود در سمـت ادمین رو بهـبود بدم.",
          "duration": "دی ۱۳۹۹ - تاکـنون",
          "links": {
            "sarrafeh": {
              "name": "صـرافـه"
            },
            "texToken": {
              "name": "تکـس توکـن"
            }
          },
          "location": "تـهران، ایـران",
          "role": "Frontend Engineer",
          "stack": "HTML / CSS / SCSS / JavaScript / ReactJS / Redux"
        },
        "sana-gostar-sabz": {
          "company": "سـانا گسـتر سبـز",
          "description": "سـانا شرکت مادر سه محصـول مختلف ماننـد خدمات خانـگی، حمل و نقـل و دستکـاری کلان داده‌ها بود. من روی دو محصـول مختلف به نـام‌های اوبـار و آچـاره کار کرده‌ام. من تونستـم با نگهـداری و بهینه‌سـازی کدهای موجود سرعت اجـرا اون‌هـارو بالا ببـرم. من همچـنین تونستـم دوتا اپلیکیشـن مختـص هر کدوم از محصـولات پیاده‌سـازی کنم که هم اکنـون دارای بیش از ۲ میلیـون کاربر هسـت. در آخر هم با پیاده‌سـازی یه اپلیکیشن برای متخصصـان آچـاره و همچنین چندین صفحه لندینـگ باحال از جمله کارهـایی بوده که انجـام دادم.",
          "duration": "دی ۱۳۹۷ - دی ۱۳۹۹",
          "links": {
            "achareh": {
              "name": "آچـاره"
            },
            "ubaar": {
              "name": "اوبـار"
            }
          },
          "location": "تـهران، ایـران",
          "role": "Frontend Engineer",
          "stack": "HTML / CSS / SCSS / JavaScript / jQuery / VueJS / VueX / ReactJS / Redux / PM2 / Apache / NginX"
        },
        "pergas-it-solutions": {
          "company": "پِرگـاس",
          "description": "پـرگاس یک بخش فناوری اطـلاعات است که زیر نظر شرکت پرگـاس طـب کار می کند. هدف پیدایشش ساخت برنامه‌های کاربـردی درون سازمانی بود. من در این مجموعـه مدیریـت و رهبری اعضای تیم فرانت‌اند، و همچنین ارائه و طراحی بهترین پلتفرم که برای همکـاران و سایر کاربران مرتبـط که کار خود را از طریق پلتفـرم انجام می‌دهنـد، تمرکـز کردم.",
          "duration": "دی ۱۳۹۸ - فروردین ۱۳۹۹",
          "location": "تـهران، ایـران",
          "role": "Frontend Engineer / Frontend Chapter Lead / Product Owner",
          "stack": "HTML / CSS / SCSS / MaterialUI / JavaScript / ReactJS"
        }
      },
      "headings": {
        "about": "دربـاره مـن",
        "contribution": "هـمکـاری عـمومـی",
        "interactive": "رزومـه تـعاملـی",
        "npm": "پکـیج‌های اِن‌پـی‌اِم"
      },
      "labels": {
        "techStack": "ابـزارهـا",
        "usefulLinks": "لینکـهای مـفیـد"
      },
      "sub-headings": {
        "summary": "خـلاصـه کوتـاه",
        "work-experience": "تجـربـه کـاری"
      }
    }
  },
  "quote": {
    "error": "مـن واقـعا متاسفم! بـرای امـروز نـقل قـول نداریـم.",
    "reason": "مـمکنه دلـیلش بـخاطر در دستـرس نـبودن سـرویس نـقل قـول‌هـا بـاشه.",
    "title": {
      "author": "جستجـو نویسـنده",
      "content": "نـقل قـول امـروز"
    }
  },
  "titles": {
    "about": "دربـاره مـن",
    "contribution": "هـمکـاری عـمومـی",
    "cookieConsent": "قبـول کـوکی",
    "dark": "تـیره",
    "github": "گیت‌هاب",
    "home": "بازگشت به صفحه اصلی",
    "index": "SMAKSS",
    "info": "اطـلاعات بیشـتر",
    "interactive": "رزومـه تـعاملـی",
    "light": "روشـن",
    "linkedin": "لینکداین",
    "npm": "اِن‌پی‌اِم‌جِی‌اِس",
    "stackoverflow": "استک اورفلو",
    "stuff": "کارها",
    "switcher": "تعویض کننده",
    "system": "بـر اسـاس تنظیمات سیستم"
  }
}
